zigmars/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


######################################################
# RV1G Minisumo 2018 (Native USB Port)
# ---------------------------------------
rv1g_minisumo_native.name=RV1G Minisumo 2018 (Native USB Port)
rv1g_minisumo_native.vid.0=0x2341
rv1g_minisumo_native.pid.0=0x804d
rv1g_minisumo_native.vid.1=0x2341
rv1g_minisumo_native.pid.1=0x004d

rv1g_minisumo_native.vid.2=0x2341
rv1g_minisumo_native.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
rv1g_minisumo_native.vid.2.build.vid=0x2341
rv1g_minisumo_native.vid.2.build.pid=0x824d
rv1g_minisumo_native.vid.2.build.usb_product="Genuino Zero"
rv1g_minisumo_native.vid.2.bootloader.file=zero/samd21_sam_ba_genuino.bin

rv1g_minisumo_native.vid.3=0x2341
rv1g_minisumo_native.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
rv1g_minisumo_native.vid.3.build.vid=0x2341
rv1g_minisumo_native.vid.3.build.pid=0x824d
rv1g_minisumo_native.vid.3.build.usb_product="Genuino Zero"
rv1g_minisumo_native.vid.3.bootloader.file=zero/samd21_sam_ba_genuino.bin

rv1g_minisumo_native.upload.tool=bossac
rv1g_minisumo_native.upload.protocol=sam-ba
rv1g_minisumo_native.upload.maximum_size=262144
rv1g_minisumo_native.upload.use_1200bps_touch=true
rv1g_minisumo_native.upload.wait_for_upload_port=true
rv1g_minisumo_native.upload.native_usb=true
rv1g_minisumo_native.build.mcu=cortex-m0plus
rv1g_minisumo_native.build.f_cpu=48000000L
rv1g_minisumo_native.build.usb_product="RV1G MiniSumo 2018"
rv1g_minisumo_native.build.usb_manufacturer="RV1G, Atmel"
rv1g_minisumo_native.build.board=SAMD_ZERO
rv1g_minisumo_native.build.core=arduino
rv1g_minisumo_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
rv1g_minisumo_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
rv1g_minisumo_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
rv1g_minisumo_native.build.variant=rv1g_minisumo
rv1g_minisumo_native.build.variant_system_lib=
rv1g_minisumo_native.build.vid=0x2341
rv1g_minisumo_native.build.pid=0x804d
rv1g_minisumo_native.bootloader.tool=openocd
rv1g_minisumo_native.bootloader.file=rv1g_minisumo/samd21_sam_ba_rv1g_minisumo_2018.bin



